{
    "Hotel": [

    ],
    "Restaurent": [

    ],
    "Trips": [

    ],
    "Destination": [
        {
            "id":1,
            "name":"Sharm El Sheikh",
            "picture":"ras-mohammed-park.jpg",
            "images":[
                "dolphina-park.jpg",
                "sharm-el-sheikh",
                "tiran.jpg"
            ],
            "description":"Diverse marine life and hundreds of Red Sea coral reef sites make Sharm El Sheikh a magnet for divers and eco-tourists. The tourist economy of this Sinai Peninsula city has grown quite rapidly over the last few decades, resulting in an upcrop of first-class resorts and posh nightlife. The waters of Ras Mohamed National Park are abundant with schools of fish and, oddly, toilets – thanks to the bathroom fixtures being transported by a cargo ship that sank during a 1981 storm",
            "reviews":[
                {
                    "id":1,
                    "name":"mohamed",
                    "comment":"its very gorgoues Destination"
                },
                {
                    "id":2,
                    "name":"islam",
                    "comment":"amazing.."
                },
                {
                    "id":3,
                    "name":"yehia",
                    "comment":"nice Destination"
                }
            ]
        },
        {
            "id":2,
            "name":"Hurghada",
            "picture":"giftun-islands-red-sea.jpg",
            "images":[
                "interno-ed-esterno.jpg",
                "makadi-water-world.jpg",
                "makadi-water-world.jpg"
            ],
            "description":"Stunning coral reefs and turquoise waters perfect for windsurfing have made Hurghada, on Egypt's Red Sea Coast, a busy resort town. Within easy reach of the stunning Giftun Islands and the Eastern Arabian Desert, Hurghada has seen enormous amounts of development in the past decade—and yes, it does seem overrun with tourists at times. But it’s a relatively easy beach escape for Europeans, and some of the world's best diving and snorkeling sites are just offshore. Walk or catch a cab to explore the old quarter, El Dahar.",
            "reviews":[
                {
                    "id":1,
                    "name":"mohamed",
                    "comment":"its very gorgoues Destination"
                },
                {
                    "id":2,
                    "name":"islam",
                    "comment":"amazing.."
                },
                {
                    "id":3,
                    "name":"yehia",
                    "comment":"nice Destination"
                }
            ]
        },
        {
            "id":3,
            "name":"Cairo",
            "picture":"cairo.jpg",
            "images":[
                "photo0jpg.jpg",
                "view-on-the-islamic-cairo.jpg",
                "wadi-el-rayn.jpg"
            ],
            "description":"Cairo’s an ancient city that also happens to be a modern metropolis—it’s one of the biggest cities in the Middle East and has the traffic and noise issues to prove it. But as long as you’re not looking for solitude, Cairo—the City of the Thousand Minarets—is a splendid place to explore Egyptian history and culture. (Editor's note: Our list was compiled before political unrest prompted many countries to issue travel warnings for Egypt. If you're currently planning a trip to Egypt, please consider the risks and monitor your government's travel alerts.",
            "reviews":[
                {
                    "id":1,
                    "name":"mohamed",
                    "comment":"its very gorgoues Destination"
                },
                {
                    "id":2,
                    "name":"islam",
                    "comment":"amazing.."
                },
                {
                    "id":3,
                    "name":"yehia",
                    "comment":"nice Destination"
                }
            ]
        },
        {
            "id":4,
            "name":"Ain Sukhna",
            "picture":"ain-sukhna.jpg",
            "images":[
                "cancun-visit-august-2015.jpg",
                "porto-sokhna-beach-resort.jpg",
                "img-20181028-115828-largejpg.jpg"
            ],
            "description":"El Ain El Sokhna is one of the most beautiful destinations to visit while in Egypt. This coastal village has been developed as a beach getaway for Cairo, accessible by a trip of less than two hours from the city. To cruise passengers, El Ain El Sukhna provides easy access to all of the sights of Cairo from the Giza Pyramids and Egyptian Museum to the Islamic Cairo",
            "reviews":[
                {
                    "id":1,
                    "name":"mohamed",
                    "comment":"its very gorgoues Destination"
                },
                {
                    "id":2,
                    "name":"islam",
                    "comment":"amazing.."
                },
                {
                    "id":3,
                    "name":"yehia",
                    "comment":"nice Destination"
                }
            ]
        },
        {
            "id":5,
            "name":"Mersa Matruh",
            "picture":"beach-area.jpg",
            "images":[
                "ageeba-beach.jpg",
                "dsc-0229-largejpg.jpg",
                "photo1jpg.jpg"
            ],
            "description":"Mersa Matruh is protected by a ring of natural rocks some seven kilometres long which acts as a breakwater; the sea, therefore, as well as being spectacular due to its intense turquoise colour, is always calm. Many of the beaches have evocative names: Cleopatra beach, in honour of the beautiful queen who loved to bathe in this sea, ",
            "reviews":[
                {
                    "id":1,
                    "name":"mohamed",
                    "comment":"its very gorgoues Destination"
                },
                {
                    "id":2,
                    "name":"islam",
                    "comment":"amazing.."
                },
                {
                    "id":3,
                    "name":"yehia",
                    "comment":"nice Destination"
                }
            ]
        },
        {
            "id":6,
            "name":"Alexandria",
            "picture":"alexandria.jpg",
            "images":[
                "an-outside-entrance-to.jpg",
                "pompey-s-pillar-and-sphinx.jpg",
                "view-from-the-hotel-of.jpg"
            ],
            "description":"The Pearl of the Mediterranean has an ambiance more in keeping with its neighbors to the north than with those in the Middle East. Site of Pharos lighthouse, one of the Wonders of the World, and of Anthony and Cleopatra’s tempestuous romance, the city was founded by Alexander the Great in 331 BCE. Today, Alexandria offers fascinating insights into its proud Greek past, as well as interesting mosques, the casino strip of the Corniche, some lovely gardens and both modern and traditional hotels. (Editor's note: Our list was compiled before political unrest prompted many countries to issue travel warnings for Egypt. If you're currently planning a trip to Egypt, please consider the risks and monitor your government's travel alerts.",
            "reviews":[
                {
                    "id":1,
                    "name":"mohamed",
                    "comment":"its very gorgoues Destination"
                },
                {
                    "id":2,
                    "name":"islam",
                    "comment":"amazing.."
                },
                {
                    "id":3,
                    "name":"yehia",
                    "comment":"nice Destination"
                }
            ]
        },
        
        {
            "id":7,
            "name":"Marsa Alam",
            "picture":"bigphotoformarsa-alam.jpg",
            "images":[
                "marsa-alam.jpg",
                "sataya-dei-delfini.jpg",
                "sataya.jpg"
            ],
            "description":"Thanks to the addition of an international airport in 2001, Marsa Alam is fast becoming a premium tourist destination, especially for scuba divers. The waters here are brimming with marine life and pristine dive sites. Landlubbers, don’t miss the Emerald Mines and the Temple of Seti I at Khanais.",
            "reviews":[
                {
                    "id":1,
                    "name":"mohamed",
                    "comment":"its very gorgoues Destination"
                },
                {
                    "id":2,
                    "name":"islam",
                    "comment":"amazing.."
                },
                {
                    "id":3,
                    "name":"yehia",
                    "comment":"nice Destination"
                }
            ]
        },
        {
            "id":8,
            "name":"El Alamein",
            "picture":"the-marina--v9514476.jpg",
            "images":[
                "el-alamein.jpg",
                "etap-resort.jpg",
                "porto-marina-resort-spa.jpg"
            ],
            "description":"The Battle of El Alamein was the largest conflict to take place in Africa during World War II and a significant turning point in the war. Before General Bernard Montgomery and the British 8th Army defeated Field Marshall Erwin Rommel and his German tank divisions, the Allies had not experienced a significant success on any front during the war. Montgomery’s army stopped the German advance toward Alexandria and Cairo, ensuring the safety of Egypt. The battle signaled the beginning of the end of Germany’s campaign in North Africa, guaranteeing the Allies control of the Suez Canal and the Middle East’s oil fields and significantly shifting the momentum of the war in favor of the Allies.",
            "reviews":[
                {
                    "id":1,
                    "name":"mohamed",
                    "comment":"its very gorgoues Destination"
                },
                {
                    "id":2,
                    "name":"islam",
                    "comment":"amazing.."
                },
                {
                    "id":3,
                    "name":"yehia",
                    "comment":"nice Destination"
                }
            ]
        },
        {
            "id":9,
            "name":"Dahab",
            "picture":"a-view-from-the-mountain.jpg",
            "images":[
                "caption.jpg",
                "dahab.jpg",
                "the-famous-blue-hole_rotated_90.jpg"
            ],
            "description":"This former Bedouin fishing village is now a popular tourist destination—especially for serious windsurfers,who'll find some of the best conditions in the world off Dahab's beaches. Long known as a laid-back,backpacker-friendly town, Dahab is becoming more developed, yet retains a casual vibe. Finally,Dahab is also home to the Blue Hole, the world's most dangerous dive site.",

            "reviews":[
                {
                    "id":1,
                    "name":"mohamed",
                    "comment":"its very gorgoues Destination"
                },
                {
                    "id":2,
                    "name":"islam",
                    "comment":"amazing.."
                },
                {
                    "id":3,
                    "name":"yehia",
                    "comment":"nice Destination"
                }
            ]
        },
        {
            "id":9,
            "name":"Luxor",
            "picture":"b145de4d72cd7da8b329e85ddcb33a10.jpg",
            "images":[
                "c6262dfcddaf7c465a831411d9effd03.jpg",
                "f0260b474d24d165223557affcdfc302.jpg",
                "f0f7b84d7f11337a98325b23e5307aea.jpg"
            ],
            "description":"At the height of the Ancient Egyptian New Kingdom (1549—1069 BC) its capital, Thebes (Luxor), was a city of over a million people. The pharaohs that ruled over this kingdom were made wealthy by military successes that expanded their influence south into Nubia, west along the Mediterranean, and east into modern-day Syria",
            "reviews":[
                {
                    "id":1,
                    "name":"mohamed",
                    "comment":"its very gorgoues Destination"
                },
                {
                    "id":2,
                    "name":"islam",
                    "comment":"amazing.."
                },
                {
                    "id":3,
                    "name":"yehia",
                    "comment":"nice Destination"
                }
            ]
        },
        {
            "id":10,
            "name":"Aswan",
            "picture":"download.jpg",
            "images":[
                "3b2dcf5f4f76f7d462e7d8f4ba6b99a2.jpg",
                "da60c4e01554a3306a7b9b01cdce259d.jpg",
                "f20135dd159bf4f54efa2f814e5254b4.jpg"
            ],
            "description":"Aswan provides a much more relaxed experience. It is the smallest of Egypt’s major touristic cities, but it also bears the distinctive mark of the more relaxed Nubian culture. Those interested in Pharaonic history cannot pass up Aswan because of the impressive Philae Temple nearby, located on an island behind the old Aswan Dam, and the famous Abu Simbel Temples several hours south along the banks of Lake Nasser.",
            "reviews":[
                {
                    "id":1,
                    "name":"mohamed",
                    "comment":"its very gorgoues Destination"
                },
                {
                    "id":2,
                    "name":"islam",
                    "comment":"amazing.."
                },
                {
                    "id":3,
                    "name":"yehia",
                    "comment":"nice Destination"
                }
            ]
        }
    ]
}





